flight_booking/Bookingcore.3.6.2.1/modules/Booking/Controllers/BookingController.php

insert into `users` (`status`, `first_name`, `last_name`, `email`, `phone`, `country`, `password`, `name`, `updated_at`, `created_at`) values ('publish', 'Yasser', 'Salah', 'ahmedyasser200441@gmail.com', '01127981242', 'EG', '$2y$12$koM1EJRJk/G8maXPfJLv8uec0ow.8QjHyHk.FXAGTvdFglud.94ya', 'Yasser Salah', '2025-07-16 13:43:21', '2025-07-16 13:43:21')
---
            $user->country = $request->input('country');
            $user->password = Hash::make($request->input('password'));
            $user->status = 'publish';
            $user->save();

update `bravo_booking_passengers` set `deleted_at` = '2025-07-16 14:11:31', `bravo_booking_passengers`.`updated_at` = '2025-07-16 14:11:31' where `bravo_booking_passengers`.`booking_id` = 49 and `bravo_booking_passengers`.`booking_id` is not null and `bravo_booking_passengers`.`deleted_at` is null
---
    protected function savePassengers(Booking $booking, Request $request)
    {
        if ($booking->service && method_exists($booking->service, 'savePassengers') ) {
            call_user_func([$booking->service, 'savePassengers'], $booking, $request);
            return;
        }
        if ($totalPassenger = $booking->calTotalPassenger()) {
            $booking->passengers()->delete();