flight_booking/Bookingcore.3.6.2.1/app/User.php

select * from `user_meta` where (`user_id` = 17 and `name` = 'social_meta_avatar') limit 1
---
    public function getMeta($key, $default = '')
    {
        //if(isset($this->cachedMeta[$key])) return $this->cachedMeta[$key];

        $val = DB::table('user_meta')->where([
            'user_id' => $this->id,
            'name'    => $key
        ])->first();

select count(`id`) as aggregate from `users` where `verify_submit_status` in ('new', 'partial') and `users`.`deleted_at` is null
---
    public static function countVerifyRequest()
    {
        return parent::query()->whereIn('verify_submit_status', ['new', 'partial'])->count(['id']);