flight_booking/Bookingcore.3.6.2.1/modules/Flight/Models/Flight.php


            $check = $booking->save();
            foreach ($request['segments'] as $i => $seg) {
    booking_flights::create([
        'booking_id'      => $booking->id,
        'fare_id'         => $seg['fare']['id'],
        'flight_id'         => $seg['flight']['id'],
        'adult_price'         => $seg['fare']['price_adult'],
        'infant_price'         => $seg['fare']['infant_price'],
        'child_price'         => $seg['fare']['child_price'],
        'segment_number'  => $i,
        // Add any additional info you want
    ]);
---
insert into `booking_flights` (`booking_id`, `fare_id`, `flight_id`, `adult_price`, `infant_price`, `child_price`, `segment_number`, `updated_at`, `created_at`) values (50, '171', '57', 54, 54, 54, 1, '2025-07-16 14:32:33', '2025-07-16 14:32:33')

        public static function getMinMaxPrice()
        {
            $min = FlightSeat::select(['price', 'flight_id'])->whereHas('flight', function (Builder $query) {
                $query->where('status', 'publish');
            })->min('price');
            $max = FlightSeat::select(['price', 'flight_id'])->whereHas('flight', function (Builder $query) {
                $query->where('status', 'publish');
            })->max('price');
---
select min(`price`) as aggregate from `bravo_flight_seat` where exists (select * from `bravo_flight` where `bravo_flight_seat`.`flight_id` = `bravo_flight`.`id` and `status` = 'publish' and `bravo_flight`.`deleted_at` is null) and `bravo_flight_seat`.`deleted_at` is null
select max(`price`) as aggregate from `bravo_flight_seat` where exists (select * from `bravo_flight` where `bravo_flight_seat`.`flight_id` = `bravo_flight`.`id` and `status` = 'publish' and `bravo_flight`.`deleted_at` is null) and `bravo_flight_seat`.`deleted_at` is null